{
  "broadArea": {
    "name": "Electronics and Communication Engineering",
    "link": "https://www.vlab.co.in/broad-area-electronics-and-communications",
    "code": "ECE"
  },
  "lab": "Microelectronics and VLSI Engineering",
  "lab_display_name": "Microelectronics VLSI",
  "phase": 2,
  "collegeName": "IITKGP",
  "baseUrl": "mevlsi-iitkgp.vlabs.ac.in",
  "introduction": "The Microelectronics and VLSI (Very Large Scale Integration) Engineering Laboratory is a specialized facility dedicated to the study, design, and development of microelectronic circuits and VLSI systems. Microelectronics and VLSI technology form the foundation of modern electronics, enabling the design of complex integrated circuits (ICs) that power everything from smartphones and computers to medical devices and advanced automotive systems. This laboratory provides students with an opportunity to understand and practice the principles of semiconductor device characteristic. <br>With an increasing demand for miniaturization, high performance, and low power consumption, VLSI engineering plays a crucial role in advancing technology across industries. The laboratory serves as a bridge between theoretical learning and practical applications, empowering students to tackle real-world challenges in electronics. This experience prepares them for careers in fields such as semiconductor device manufacturing, equipping them with the skills needed to innovate and excel in the rapidly evolving world of microelectronics",
  "experiments": [
    {
      "name": "PMOS Capacitor Band Diagram",
      "short-name": "pmos-capacitor",
      "repo": "https://github.com/virtual-labs/exp-pmos-capacitor-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "BJT Characterization (Gummel Plot)",
      "short-name": "bjit-characterization",
      "repo": "https://github.com/virtual-labs/exp-bjit-characterization-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Output Characteristics of a NPN Transistor",
      "short-name": "npn-transistor",
      "repo": "https://github.com/virtual-labs/exp-npn-transistor-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Reverse Biasing in a P-channel JFET",
      "short-name": "p-channel-jfet",
      "repo": "https://github.com/virtual-labs/exp-p-channel-jfet-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Output Characteristics of n-channel JFET",
      "short-name": "n-channel-jfet",
      "repo": "https://github.com/virtual-labs/exp-n-channel-jfet-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Electrical Properties of pn Junction in Depletion Mode",
      "short-name": "pn-junction",
      "repo": "https://github.com/virtual-labs/exp-pn-junction-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "IV characteristics of a PN junction diode",
      "short-name": "pn-junction-diode",
      "repo": "https://github.com/virtual-labs/exp-pn-junction-diode-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Variation of Fermi Energy Level and Carrier Concentration with Temperature",
      "short-name": "fermi-carrier",
      "repo": "https://github.com/virtual-labs/exp-fermi-carrier-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "C-V characterization of PMOS capacitors",
      "short-name": "cv-pmos",
      "repo": "https://github.com/virtual-labs/exp-cv-pmos-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    },
    {
      "name": "Output characteristics of an n-channel MOSFET",
      "short-name": "mosfet",
      "repo": "https://github.com/virtual-labs/exp-mosfet-iitkgp",
      "tag": "v1.1.0",
      "deploy": true
    }
  ],
  "targetAudience": {
    "UG": [
      "Undergraduate students students of Electronics Engineering"
    ],
    "PG": [
      "Post-graduate students of Electronics Engineering"
    ]
  },
  "objective": "<b>Develop Foundational Knowledge in Microelectronics</b>: Provide students with a thorough understanding of microelectronic circuits, semiconductor device physics, and VLSI design principles, essential for building expertise in electronics and integrated circuit technology.<br> <b>Bridge Theory and Real-World Application:</b> Allow students to apply theoretical knowledge in practical scenarios, from designing simple microelectronic circuits to complex VLSI systems, providing a concrete understanding of how devices function at the micro and nano scale.<br><b>Cultivate Problem-Solving and Critical Thinking Skills:</b> Engage students in projects that challenge them to solve real-world microelectronics and VLSI engineering problems, promoting analytical thinking and innovative solutions in design and fabrication.<br><b>Promote Safety and Ethics in Engineering:</b> Instill an understanding of ethical considerations, intellectual property issues, and safety standards in microelectronics and VLSI engineering, ensuring that students are aware of their responsibilities as engineers.<br>These objectives aim to provide a comprehensive learning experience, enabling students to develop the expertise and practical skills necessary for advancing in the field of microelectronics and VLSI engineering.",
  "courseAlignment": {
    "description": "The lab contents are chosen such that it covers the syllabi of the Electronics Engineering course's of various universities",
    "universities": [
      "IIT Kharagpur"
    ]
  }
}
